OpenDTEF-v2012/tutorials/verificationAndValidation/turbulentInflow/PCF/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

endTime=10
if notTest "$@"
then
    endTime=85
fi

sed "s|END_TIME|$endTime|g" system/controlDict.template > system/controlDict

restore0Dir

runApplication blockMesh

rm -rf results

#------------------------------------------------------------------------------
